---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.CannotComputeRailingsElevationError
source: html/0821f8e7-721f-4774-4f9c-f4d747ee86e1.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.CannotComputeRailingsElevationError Property

Can't compute Railings Elevation Profile.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotComputeRailingsElevationError { get; }
```